Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_psram.c
  BL702_MemCpy(regValue, psramCtrlBuf, 1);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Write psram register
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                * @param  regValue: Register value pointer storing data
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION Psram_WriteReg(SPI_Psram_Cfg_Type *psramCfg, uint8_t *regValue) {
  /* Check the parameters */
  CHECK_PARAM(IS_PSRAM_CTRL_MODE(psramCfg->ctrlMode));

  uint8_t *const       psramCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  SF_Ctrl_Cmd_Cfg_Type psramCmd;

  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  BL702_MemCpy(psramCtrlBuf, regValue, 1);

  if (psramCfg->ctrlMode == PSRAM_QPI_CTRL_MODE) {
    psramCmd.cmdMode  = SF_CTRL_CMD_4_LINES;
    psramCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    psramCmd.dataMode = SF_CTRL_DATA_4_LINES;
  }

  psramCmd.cmdBuf[0] = (psramCfg->writeRegCmd) << 24;
  psramCmd.rwFlag    = SF_CTRL_WRITE;
  psramCmd.addrSize  = 3;
  psramCmd.nbData    = 1;

  SF_Ctrl_SendCmd(&psramCmd);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Set psram driver strength
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_SetDriveStrength(SPI_Psram_Cfg_Type *psramCfg) {
  uint32_t stat = 0;
  /* Check the parameters */
  CHECK_PARAM(IS_PSRAM_DRIVE_STRENGTH(psramCfg->driveStrength));

  Psram_ReadReg(psramCfg, (uint8_t *)&stat);

  if ((stat & 0x3) == psramCfg->driveStrength) {
    return SUCCESS;
  }

  stat &= (~0x3);
  stat |= psramCfg->driveStrength;

  Psram_WriteReg(psramCfg, (uint8_t *)&stat);
  /* Wait for write done */

  Psram_ReadReg(psramCfg, (uint8_t *)&stat);

  if ((stat & 0x3) == psramCfg->driveStrength) {
    return SUCCESS;
  }

  return ERROR;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Set psram burst wrap size
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_SetBurstWrap(SPI_Psram_Cfg_Type *psramCfg) {
  uint32_t stat = 0;
  /* Check the parameters */
  CHECK_PARAM(IS_PSRAM_BURST_LENGTH(psramCfg->burstLength));

  Psram_ReadReg(psramCfg, (uint8_t *)&stat);

  if (((stat >> 5) & 0x3) == psramCfg->burstLength) {
    return SUCCESS;
  }

  stat &= (~(0x3 << 5));
  stat |= (psramCfg->burstLength << 5);

  Psram_WriteReg(psramCfg, (uint8_t *)&stat);
  /* Wait for write done */

  Psram_ReadReg(psramCfg, (uint8_t *)&stat);

  if (((stat >> 5) & 0x3) == psramCfg->burstLength) {
    return SUCCESS;
  }

  return ERROR;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Get psram ID
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                * @param  data: Data pointer to store read data
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION Psram_ReadId(SPI_Psram_Cfg_Type *psramCfg, uint8_t *data) {
  uint8_t *const       psramCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  SF_Ctrl_Cmd_Cfg_Type psramCmd;

