Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_psram.c
  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  psramCmd.cmdBuf[0] = (psramCfg->readIdCmd) << 24;
  psramCmd.rwFlag    = SF_CTRL_READ;
  psramCmd.addrSize  = 3;
  psramCmd.dummyClks = psramCfg->readIdDmyClk;
  psramCmd.nbData    = 8;

  SF_Ctrl_SendCmd(&psramCmd);

  while (SET == SF_Ctrl_GetBusyState()) {}

  BL702_MemCpy(data, psramCtrlBuf, 8);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Psram enter quad mode
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_EnterQuadMode(SPI_Psram_Cfg_Type *psramCfg) {
  SF_Ctrl_Cmd_Cfg_Type psramCmd;

  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  psramCmd.cmdBuf[0] = (psramCfg->enterQuadModeCmd) << 24;
  psramCmd.rwFlag    = SF_CTRL_READ;

  SF_Ctrl_SendCmd(&psramCmd);

  while (SET == SF_Ctrl_GetBusyState()) {}

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Psram exit quad mode
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_ExitQuadMode(SPI_Psram_Cfg_Type *psramCfg) {
  SF_Ctrl_Cmd_Cfg_Type psramCmd;

  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  psramCmd.cmdMode  = SF_CTRL_CMD_4_LINES;
  psramCmd.addrMode = SF_CTRL_ADDR_4_LINES;
  psramCmd.dataMode = SF_CTRL_DATA_4_LINES;

  psramCmd.cmdBuf[0] = (psramCfg->exitQuadModeCmd) << 24;
  psramCmd.rwFlag    = SF_CTRL_READ;

  SF_Ctrl_SendCmd(&psramCmd);

  while (SET == SF_Ctrl_GetBusyState()) {}

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Psram toggle burst length
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                * @param  ctrlMode: Psram ctrl mode type
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_ToggleBurstLength(SPI_Psram_Cfg_Type *psramCfg, PSRAM_Ctrl_Mode ctrlMode) {
  SF_Ctrl_Cmd_Cfg_Type psramCmd;
  /* Check the parameters */
  CHECK_PARAM(IS_PSRAM_CTRL_MODE(ctrlMode));

  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  if (ctrlMode == PSRAM_QPI_CTRL_MODE) {
    psramCmd.cmdMode  = SF_CTRL_CMD_4_LINES;
    psramCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    psramCmd.dataMode = SF_CTRL_DATA_4_LINES;
  }

  psramCmd.cmdBuf[0] = (psramCfg->burstToggleCmd) << 24;
  psramCmd.rwFlag    = SF_CTRL_READ;

  SF_Ctrl_SendCmd(&psramCmd);

  while (SET == SF_Ctrl_GetBusyState()) {}

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Psram software reset
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                * @param  ctrlMode: Psram ctrl mode type
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_SoftwareReset(SPI_Psram_Cfg_Type *psramCfg, PSRAM_Ctrl_Mode ctrlMode) {
  SF_Ctrl_Cmd_Cfg_Type psramCmd;
  /* Check the parameters */
  CHECK_PARAM(IS_PSRAM_CTRL_MODE(ctrlMode));

