Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_psram.c
  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  if (ctrlMode == PSRAM_QPI_CTRL_MODE) {
    psramCmd.cmdMode  = SF_CTRL_CMD_4_LINES;
    psramCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    psramCmd.dataMode = SF_CTRL_DATA_4_LINES;
  }

  /* Reset enable */
  psramCmd.cmdBuf[0] = (psramCfg->resetEnableCmd) << 24;
  /* rwFlag don't care */
  psramCmd.rwFlag = SF_CTRL_READ;
  /* Wait for write done */

  SF_Ctrl_SendCmd(&psramCmd);

  while (SET == SF_Ctrl_GetBusyState()) {}

  /* Reset */
  psramCmd.cmdBuf[0] = (psramCfg->resetCmd) << 24;
  /* rwFlag don't care */
  psramCmd.rwFlag = SF_CTRL_READ;
  SF_Ctrl_SendCmd(&psramCmd);

  while (SET == SF_Ctrl_GetBusyState()) {}

  BL702_Delay_US(50);
  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Psram set IDbus config
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                * @param  ioMode: Psram ctrl mode type
                                                                                * @param  addr: Address to read/write
                                                                                * @param  len: Data length to read/write
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_Set_IDbus_Cfg(SPI_Psram_Cfg_Type *psramCfg, SF_Ctrl_IO_Type ioMode, uint32_t addr, uint32_t len) {
  uint8_t              cmd, dummyClks;
  SF_Ctrl_Cmd_Cfg_Type psramCmd;
  uint8_t              cmdValid = 1;
  /* Check the parameters */
  CHECK_PARAM(IS_SF_CTRL_IO_TYPE(ioMode));

  SF_Ctrl_Set_Owner(SF_CTRL_OWNER_IAHB);

  /* read mode cache set */
  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  if (SF_CTRL_NIO_MODE == ioMode) {
    cmd       = psramCfg->fReadCmd;
    dummyClks = psramCfg->fReadDmyClk;
  } else if (SF_CTRL_QIO_MODE == ioMode) {
    psramCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    psramCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = psramCfg->fReadQuadCmd;
    dummyClks         = psramCfg->fReadQuadDmyClk;
  } else {
    return ERROR;
  }

  /* prepare command */
  psramCmd.rwFlag    = SF_CTRL_READ;
  psramCmd.addrSize  = 3;
  psramCmd.cmdBuf[0] = (cmd << 24) | addr;
  psramCmd.dummyClks = dummyClks;
  psramCmd.nbData    = len;
  SF_Ctrl_Psram_Read_Icache_Set(&psramCmd, cmdValid);

  /* write mode cache set */
  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  if (SF_CTRL_NIO_MODE == ioMode) {
    cmd = psramCfg->writeCmd;
  } else if (SF_CTRL_QIO_MODE == ioMode) {
    psramCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    psramCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = psramCfg->quadWriteCmd;
  } else {
    return ERROR;
  }

  dummyClks = 0;

  /* prepare command */
  psramCmd.rwFlag    = SF_CTRL_WRITE;
  psramCmd.addrSize  = 3;
  psramCmd.cmdBuf[0] = (cmd << 24) | addr;
  psramCmd.dummyClks = dummyClks;
  psramCmd.nbData    = len;
  SF_Ctrl_Psram_Write_Icache_Set(&psramCmd, cmdValid);
  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Set cache write to psram with cache
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                * @param  ioMode: Psram controller interface mode
                                                                                * @param  wtEn: Psram cache write through enable
                                                                                * @param  wbEn: Psram cache write back enable
                                                                                * @param  waEn: Psram cache write allocate enable
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_Cache_Write_Set(SPI_Psram_Cfg_Type *psramCfg, SF_Ctrl_IO_Type ioMode, BL_Fun_Type wtEn, BL_Fun_Type wbEn, BL_Fun_Type waEn) {
  BL_Err_Type stat;

  /* Cache now only support 32 bytes read */
  stat = Psram_Set_IDbus_Cfg(psramCfg, ioMode, 0, 32);

  if (SUCCESS != stat) {
    return stat;
  }

  L1C_Cache_Write_Set(wtEn, wbEn, waEn);
  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Write psram one region
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                * @param  ioMode: Write mode: SPI mode or QPI mode
                                                                                * @param  addr: Start address to be write
                                                                                * @param  data: Data pointer to be write
                                                                                * @param  len: Data length to be write
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_Write(SPI_Psram_Cfg_Type *psramCfg, SF_Ctrl_IO_Type ioMode, uint32_t addr, uint8_t *data, uint32_t len) {
  uint8_t *const       psramCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint32_t             i = 0, curLen = 0;
  uint32_t             burstLen = 512;
  uint8_t              cmd;
  SF_Ctrl_Cmd_Cfg_Type psramCmd;
  /* Check the parameters */
  CHECK_PARAM(IS_SF_CTRL_IO_TYPE(ioMode));

