Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_psram.c
  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  if (SF_CTRL_NIO_MODE == ioMode) {
    cmd = psramCfg->writeCmd;
  } else if (SF_CTRL_QIO_MODE == ioMode) {
    psramCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    psramCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = psramCfg->quadWriteCmd;
  } else {
    return ERROR;
  }

  /* Prepare command */
  psramCmd.rwFlag   = SF_CTRL_WRITE;
  psramCmd.addrSize = 3;

  if (psramCfg->burstLength == PSRAM_BURST_LENGTH_16_BYTES) {
    burstLen = 16;
  } else if (psramCfg->burstLength == PSRAM_BURST_LENGTH_32_BYTES) {
    burstLen = 32;
  } else if (psramCfg->burstLength == PSRAM_BURST_LENGTH_64_BYTES) {
    burstLen = 64;
  } else if (psramCfg->burstLength == PSRAM_BURST_LENGTH_512_BYTES) {
    burstLen = 512;
  }

  for (i = 0; i < len;) {
    /* Get current programmed length within page size */
    curLen = burstLen - addr % burstLen;

    if (curLen > len - i) {
      curLen = len - i;
    }

    /* Prepare command */
    BL702_MemCpy_Fast(psramCtrlBuf, data, curLen);
    psramCmd.cmdBuf[0] = (cmd << 24) | (addr);
    psramCmd.nbData    = curLen;

    SF_Ctrl_SendCmd(&psramCmd);

    /* Adjust address and programmed length */
    addr += curLen;
    i += curLen;
    data += curLen;

    /* Wait for write done */
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Read data from psram
                                                                                *
                                                                                * @param  psramCfg: Serial psram parameter configuration pointer
                                                                                * @param  ioMode: IoMode: psram controller interface mode
                                                                                * @param  addr: Psram read start address
                                                                                * @param  data: Data pointer to store data read from psram
                                                                                * @param  len: Data length to read
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION Psram_Read(SPI_Psram_Cfg_Type *psramCfg, SF_Ctrl_IO_Type ioMode, uint32_t addr, uint8_t *data, uint32_t len) {
  uint8_t *const       psramCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint32_t             curLen, i;
  uint32_t             burstLen = 512;
  uint8_t              cmd, dummyClks;
  SF_Ctrl_Cmd_Cfg_Type psramCmd;
  /* Check the parameters */
  CHECK_PARAM(IS_SF_CTRL_IO_TYPE(ioMode));

  if (((uint32_t)&psramCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&psramCmd, 0, sizeof(psramCmd) / 4);
  } else {
    BL702_MemSet(&psramCmd, 0, sizeof(psramCmd));
  }

  if (SF_CTRL_NIO_MODE == ioMode) {
    cmd       = psramCfg->fReadCmd;
    dummyClks = psramCfg->fReadDmyClk;
  } else if (SF_CTRL_QIO_MODE == ioMode) {
    psramCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    psramCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = psramCfg->fReadQuadCmd;
    dummyClks         = psramCfg->fReadQuadDmyClk;
  } else {
    return ERROR;
  }

  /* Prepare command */
  psramCmd.rwFlag    = SF_CTRL_READ;
  psramCmd.addrSize  = 3;
  psramCmd.dummyClks = dummyClks;

  if (psramCfg->burstLength == PSRAM_BURST_LENGTH_16_BYTES) {
    burstLen = 16;
  } else if (psramCfg->burstLength == PSRAM_BURST_LENGTH_32_BYTES) {
    burstLen = 32;
  } else if (psramCfg->burstLength == PSRAM_BURST_LENGTH_64_BYTES) {
    burstLen = 64;
  } else if (psramCfg->burstLength == PSRAM_BURST_LENGTH_512_BYTES) {
    burstLen = 512;
  }

  /* Read data */
  for (i = 0; i < len;) {
    /* Prepare command */
    psramCmd.cmdBuf[0] = (cmd << 24) | (addr);
    curLen             = burstLen - addr % burstLen;

    if (curLen > len - i) {
      curLen = len - i;
    }

    if (curLen >= FLASH_CTRL_BUF_SIZE) {
      curLen          = FLASH_CTRL_BUF_SIZE;
      psramCmd.nbData = curLen;
    } else {
      /* Make sf_ctrl word read */
      psramCmd.nbData = ((curLen + 3) >> 2) << 2;
    }

    SF_Ctrl_SendCmd(&psramCmd);

    while (SET == SF_Ctrl_GetBusyState()) {}

    BL702_MemCpy_Fast(data, psramCtrlBuf, curLen);

    addr += curLen;
    i += curLen;
    data += curLen;
  }

  return SUCCESS;
}
#endif

/*@} end of group PSRAM_Public_Functions */

/*@} end of group PSRAM */

/*@} end of group BL702_Peripheral_Driver */
